#### DocumentEntryPoint Members

---

|  |
| --- |
| DocumentEntryPoint Class   Constructors   Methods   Properties   See Also |

The  DocumentEntryPoint  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | DocumentEntryPoint | Initializes a new instance of the  DocumentEntryPoint  class |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | CanPlaceElementType | Verifies that the user can be prompted to place the input element type interactively. (Inherited from  UIDocument  .) |
| Public method | Dispose | (Inherited from  UIDocument  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | FinishInitializationEO | For Revit Macros internal use only. |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetOpenUIViews | Get a list of all open view windows in the Revit user interface. (Inherited from  UIDocument  .) |
| Public method | GetPlacementTypes | Get a collection of valid placement types for input family symbol. (Inherited from  UIDocument  .) |
| Public method | GetSketchGalleryOptions | Gets the valid sketch gallery options of a family symbol. (Inherited from  UIDocument  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | Initialize | For Revit Macros internal use only. |
| Public method | OnShutdownEO | For Revit Macros internal use only. |
| Public method | PostRequestForElementTypePlacement | Places a request on Revit's command queue for the user to place instances of the specified ElementType. This does not execute immediately, but instead when control returns to Revit from the current API context. (Inherited from  UIDocument  .) |
| Public method | PromptForFamilyInstancePlacement(FamilySymbol) | Prompts the user to place instances of the specified FamilySymbol. (Inherited from  UIDocument  .) |
| Public method | PromptForFamilyInstancePlacement(FamilySymbol, PromptForFamilyInstancePlacementOptions) | Prompts the user to place instances of the specified FamilySymbol. (Inherited from  UIDocument  .) |
| Public method | PromptToMatchElementType | Prompts the user to select elements to change them to the input type. (Inherited from  UIDocument  .) |
| Public method | PromptToPlaceElementTypeOnLegendView | Prompts the user to place an element type onto a legend view. (Inherited from  UIDocument  .) |
| Public method | PromptToPlaceViewOnSheet | Prompts the user to place a specified view onto a sheet. (Inherited from  UIDocument  .) |
| Public method | RefreshActiveView | Refresh the display of the active view in the active document. (Inherited from  UIDocument  .) |
| Public method | RequestViewChange | Requests an asynchronous change of the active view in the currently active document. (Inherited from  UIDocument  .) |
| Public method | SaveAndClose | Close the document, prompting the user for saving it when necessary. (Inherited from  UIDocument  .) |
| Public method | SaveAs | Saves the document to a file name obtained from the Revit user without prompting the user to overwrite file if it exists. (Inherited from  UIDocument  .) |
| Public method | SaveAs(UISaveAsOptions) | Saves the document to a file name obtained from the Revit user optionally prompting the user to overwrite file if it exists. (Inherited from  UIDocument  .) |
| Public method | ShowElements(Element) | Shows the element by zoom to fit. (Inherited from  UIDocument  .) |
| Public method | ShowElements(ElementId) | Shows the element by zoom to fit. (Inherited from  UIDocument  .) |
| Public method | ShowElements(ICollection ElementId ) | Shows the elements by zoom to fit. (Inherited from  UIDocument  .) |
| Public method | ShowElements(ElementSet) | Shows the elements by zoom to fit. (Inherited from  UIDocument  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |
| Public method | UpdateAllOpenViews | Update all open views in this document after elements have been changed, deleted, selected or de-selected. Graphics in the views are fully redrawn regardless of which elements have changed. (Inherited from  UIDocument  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | ActiveGraphicalView | The currently active graphical view of the currently active document. (Inherited from  UIDocument  .) |
| Public property | ActiveView | The currently active view of the currently active document. (Inherited from  UIDocument  .) |
| Public property | AddinFolder | The full path to the Revit Macros module. |
| Public property | Application | Retrieves an object that represents the current Application. (Inherited from  UIDocument  .) |
| Public property | Document | Returns the database level document represented by this UI-level document. (Inherited from  UIDocument  .) |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from  UIDocument  .) |
| Public property | Selection | Retrieve the currently selected Elements in Autodesk Revit. (Inherited from  UIDocument  .) |

# See Also

DocumentEntryPoint Class

Autodesk.Revit.UI.Macros Namespace